#-----------------------------------------------------------------------------------
#26. 強調マークアップの除去
#25の処理時に，テンプレートの値からMediaWikiの強調マークアップ（弱い強調，強調，強い強調のすべて）を除去してテキストに変換せよ（参考: マークアップ早見表）．
#-----------------------------------------------------------------------------------

import nlp20
import re

lines = nlp20.getUK().split("\n")#importしてモジュール呼び出し

dic = {} #辞書

for line in lines:
    if " = " in line:#取得結果から「 = 」で抽出
        m = re.split(r' = ', line)
        if m:
            #dic[m[0].replace("\a", "")] = m[1].replace("\a", "") #★置換して格納
            print(m[0].replace("\a", ""))
            print(m[0].replace("'", ""))
            print(m[0].replace("\'", ""))
        #    print("none!") 
            
#print(dic)

